Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེས་དེར་རབ་ཏུ་བྱུང་ནས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ། འཆི་ཀར་སྨོན་ལམ་བཏབ་པ་དེས་ན་
en: At that time she went forth, practiced pure conduct all her life, and prayed thus at the time of her death.

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ།
en: that she has pleased me, not displeased me,

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས།
en: and manifested arhatship,

source: ངས་འདི་ཐོས་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ།། །།
en: and that I have commended her as foremost among keepers of the teachings.”

source: མིའམ་ཅི་གཉིས་ཞེས་བྱ་བ་དེ་ལ།
en: The Kinnara Spirits: Two Stories

source: མིའམ་ཅི་དང་པོ་ནི་
en: The First “Kinnara” Story

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན། ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས་
en: When the Blessed One was in Śrāvastī, there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནསདེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: When the time came for him to marry he took a wife, and as they enjoyed themselves and coupled, one day his wife conceived.

source: དེ་ཟླ་བ་དགུའམ། བཅུ་ལོན་པ་དང་། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་མདོག་བཟང་བ། གསེར་གྱི་མདོག་ཅན་མགོ་བོ་གདུགས་ལྟར་འདུག་པ། ལག་པ་རིང་བ་དཔྲལ་བའི་དབྱེས་ཆེ་བ་སྣ་མཐོ་བ། སྣ་ལེགས་པ། སྨིན་མ་སྟུག་པ་ཞིག་བཙས་ཏེ
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, with glowing, golden skin and a well-rounded head, long arms, a broad brow, a fine and prominent nose, and eyebrows that met.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ། ཁྱེའུ་འདིའི་མིང་ཅི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: At the elaborate feast celebrating his birth they asked, “What name should we give this child?” and they named him, saying,

source: ཁྱེའུ་འདི་མཆོག་ཏུ་བྱད་གཟུགས་མཛེས་ཏེ། བྱད་གཟུགས་མིའམ་ཅི་དང་འདྲ་བས་ན། ཁྱེའུ་འདིའི་མིང་མི་འམ་ཅི་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: “Since this boy is extremely beautiful, and his appearance just like that of a kinnara spirit, his name will be Kinnara .”

source: དེ་ནས་ཁྱེའུ་མི་འམ་ཅི་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: They reared young Kinnara on milk, yogurt, butter, ghee, and milk solids,

source: མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: and he flourished like a lotus in a lake.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཡི་གེ་དང་། ཁོང་རྩིས་དང་། ཤོད་དགོད་པ་དང་། ལག་རྩིས་དང་། དབྱུང་བ་དང་། སྦ་བ་དང་། དགྲམ་པ་དང་། གོས་བརྟག་པ་དང་། ནོར་བུ་བརྟག་པ་དང་། རིན་པོ་ཆེ་བརྟག་པ་དང་། སྤོས་བརྟག་པ་དང་། སྨན་བརྟག་པ་དང་། གླང་པོ་ཆེ་བརྟག་པ་དང་། རྟ་བརྟག་པ་དང་། གོ་མཚོན་བརྟག་པ་བསླབས་ཏེ།
en: As he grew up he studied letters, tallying, and arithmetic; the study of seals, lending, deposits, and commerce; and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: དེ་ནས་གྲོང་ཁྱེར་ཆེན་པོ་དྲུག་པོ་ཐམས་ཅད་དུ་དེའི་གྲགས་པ་རྒྱས་པར་གྱུར་ཏེ། མཉན་དུ་ཡོད་པ་ན། ཁྱིམ་བདག་ཆེ་གེ་མོའི་བུ་བྱད་གཟུགས་མི་འམ་ཅི་དང་འདྲ་བ་ཞིག་སྐྱེས་སོ་ཞེས་གྲགས་སོ། །
en: Soon word spread throughout the six cities that in Śrāvastī such-and-such a householder’s child had an appearance just like that of a kinnara spirit.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཡ་མཚན་དུ་གྱུར་ཏེ། དེ་བལྟ་བའི་ཕྱིར་དོང་ངོ་། །
en: When the people heard this they were amazed, so they rushed to see him.

source: དེ་ནས་དེ་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པས་དྲེགས་ནས་སུ་ལ་ཡང་ཕྱག་མི་འཚལ། སུ་ལ་ཡང་མི་ལྡང་སྟེ།
en: Soon he became arrogant about his appearance and would not bow or stand out of respect for anyone.

source: བྱད་གཟུགས་ང་དང་མཚུངས་པ་མེད་དོ་སྙམ་མོ། །
en: “No one strikes as fine a figure as I,” he thought.

source: དེ་ནས་དེའི་ཕ་མ་གཉིས་ཀྱིས་བསམས་པ། འདིའི་ང་རྒྱལ་བསལ་དགོས་ཏེ།
en: “We must dispel his pride,” his parents thought.

source: འདི་ལ་བཅོམ་ལྡན་འདས་བསྟན་པར་བྱའོ་སྙམ་ནས་སྨྲས་པ།
en: “We shall show him the Blessed One.”

source: བུ་སུ་ཡང་ང་དང་མཚུངས་པ་མེད་དོ་སྙམ་དུ་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པས་དྲེགས་པར་མ་བྱེད་ཅིག །
en: “Oh child,” they said, “do not think that no one strikes as fine a figure as you.

source: བུ་ཁྱོད་ཀྱིས་བཅོམ་ལྡན་འདས་མ་མཐོང་སྟེ།
en: Child, you have not seen the Blessed One.

source: ཁྱོད་ནི་དེའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་ཕོད། སྟོང་གི་ཆར་ཡང་ཉེ་བར་མི་ཕོད། འབུམ་གྱི་ཆར་ཡང་ཉེ་བར་མི་ཕོད་དོ་ཞེས་བྱས་སོ། །
en: Your appearance is not even a hundredth, not even a thousandth, not even a hundred thousandth as fine as his.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དེ་ཡ་མཚན་དུ་གྱུར་ཏོ། །
en: Upon hearing this he immediately began thinking,

source: བདག་པས་དགེ་སྦྱོང་གཽ་ཏ་མ་ཆེས་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་བལྟ་སྙམ་ནས།
en: “We shall see whether the ascetic Gautama is really more handsome and well proportioned than I.”

source: སྐྱེ་བོ་མང་པོས་གཡོག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ངོ་། །
en: He went to see the Blessed One accompanied by a great crowd.

source: ཁྱེའུ་དེས་ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ།
en: The boy saw the Blessed One from a distance. His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire,

source: མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ་
en: like a lamp set in a golden vessel,

source: མཐོང་ནས་ཀྱང་དེའི་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པས་དྲེགས་པ་དེ་མེད་པར་གྱུར་ཏོ། །
en: When he saw the Blessed One, all his arrogance about his own appearance vanished,

source: དེ་ནས་དེ་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: and he experienced a surge of joy toward the Blessed One.

source: དགའ་བར་གྱུར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: In his joy he approached the Blessed One,

source: དེས་ན་ཁྱེའུ་མི་འམ་ཅིས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ། འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Hearing it, young Kinnara destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where he sat.

source: དེས་བདེན་པ་མཐོང་ནས་ཕ་མ་གཉིས་ལ་གསོལ་ཏེ།
en: After seeing the truths, he asked for his parents’ permission,

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་དེའི་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པ་བསལ་ནས།
en: “Lord,” the monks requested of the Blessed Buddha, “tell us why the Blessed One dispelled this youth’s arrogance about his appearance

source: གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཞག་པ་ལ་གཟིགས།
en: and established him in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་ངས་འདིའི་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པ་བསལ་ནས། ཇི་ལྟར་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་གནས་པར་བྱས་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, I dispelled his arrogance about his appearance and placed him in the four meditative states and five superknowledges. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་བྲམ་ཟེ་ཞིག་གནས་པ་དེས།
en: “Monks, in times gone by, there lived a certain brahmin in the city of Vārāṇasī.

source: ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས། དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས།
en: When the time came for him to marry he took a wife, and as they enjoyed themselves and coupled, one day his wife conceived.

source: ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས། དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས།
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེ་འོ་མ་དང་། ཞོ་དང་མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: “They reared him on milk, yogurt, butter, ghee, and milk solids,

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། བྱད་གཟུགས་ཀྱིས་རྒྱགས་པས་དྲེགས་ནས།
en: and when he grew up he became arrogant about his appearance.

source: སུ་ལ་ཡང་གསོང་པོར་སྨྲ་བ་དང་། ཕྱག་འཚལ་བ་དང་། ལྡང་བ་མི་བྱེད་དོ། །
en: He would not speak sincerely to anyone, or bow, or stand out of respect.

source: དེ་ནས་དེའི་ཚེ་ཕ་མ་གཉིས་ཀྱིས་བསམས་པ།
en: Soon his parents thought,

source: འདིའི་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པ་བསལ་དགོས་སོ། །
en: ‘We must dispel his arrogance about his appearance,

source: དེ་ལྟར་མ་བྱས་ན་འདི་ཞི་བར་མི་འགྱུར་རོ་སྙམ་མོ། །
en: for if we don’t, it will never subside.’

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱིའི་ས་ཕྱོགས་ཞིག་ན། དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ། རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་གནས་ཏེ།
en: “At that time there lived a certain sage in one area of Vārāṇasī who had all the five superknowledges, a person of great miracles and great power.

source: དེ་ནས་བྲམ་ཟེ་དེས་དྲང་སྲོང་དེ་ལ་གསོལ་པ།
en: The brahmin said to the sage,

source: ཁྱེའུ་འདི་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པས་དྲེགས་ནས།
en: ‘Our son is arrogant about his appearance—

source: སུ་ལ་ཡང་གསོང་པོར་སྨྲ་བ་དང་། ཕྱག་འཚལ་བ་དང་ལྡང་བ་ཡང་མི་བགྱིད་ཀྱིས།
en: he will not speak sincerely to anyone and will neither bow nor stand.

source: ཁྱོད་ཀྱིས་དེའི་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པ་བསལ་དུ་གསོལ་ཞེས་བྱས་སོ། །
en: Please, dispel his arrogance about his appearance.’

source: དེ་ནས་དྲང་སྲོང་དེས་བྲམ་ཟེ་དེ་ལ་ཅང་མི་སྨྲ་བས་ཁས་བླངས་སོ། །
en: The sage assented to the brahmin by his silence,

source: དེ་ནས་བྲམ་ཟེ་དེ་དྲང་སྲོང་དེའི་ཐད་ནས་སོང་ནས།
en: and the brahmin took leave of the sage.

source: བུ་ལ་སྨྲས་པ་བུ་ཁྱོད་བྱད་གཟུགས་བདག་དང་མཚུངས་པ་མེད་དོ་སྙམ་དུ་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པར་མ་བྱེད་ཅིག །
en: “ ‘Child,’ the brahmin said, ‘Do not be so arrogant as to think that no one is your equal in appearance.

source: དཀའ་ཐུབ་ཀྱི་གནས་ཆེ་གེ་མོ་ཞིག་ན་དྲང་སྲོང་ཞིག་གནས་ཏེ།
en: In such-and-such a place devoted to austerities there lives a sage,

source: དེ་ལ་ནི་ཁྱོད་ཀྱི་བྱད་གཟུགས་ཀྱིས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་ཕོད། སྟོང་གི་ཆར་ཡང་ཉེ་བར་མི་ཕོད། འབུམ་གྱི་ཆར་ཡང་ཉེ་བར་མི་ཕོད་དོ་ཞེས་བྱས་སོ། །
en: and your appearance is not even a hundredth, not even a thousandth, not even a hundred thousandth as fine as his.’

source: དེ་ནས་དེ་ཡ་མཚན་དུ་གྱུར་ཏོ། །
en: “The young man was astonished,

source: དེ་ཡ་མཚན་དུ་གྱུར་ནས། དྲང་སྲོང་དེ་ག་ལ་འདུག་པ་དེར་སོང་སྟེ།
en: and in his astonishment he went to see the sage.

source: དྲང་སྲོང་དེས་ཁྱེའུ་དེ་མཐོང་ནས་དེས་ཁྱེའུ་དེ་བས་ཆེས་བྱད་གཟུགས་བཟང་བར་བདག་ཉིད་སྤྲུལ་ཏོ། །
en: Upon seeing the young man, the sage emanated himself so that his appearance was superior to the youth’s own.

source: དེ་ནས་ཁྱེའུ་དེས་ཐག་རིང་པོ་ཞིག་ནས་དྲང་སྲོང་དེ་ཆེས་གཟུགས་བཟང་བ་དང་། ཆེས་བལྟ་ན་སྡུག་པ་དང་ཆེས་མཛེས་པ་མཐོང་ངོ་། །
en: From a distance the young man saw the sage, who was well proportioned, pleasing to the eye, and beautiful.

source: མཐོང་ནས་ཀྱང་དེའི་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པ་མེད་པར་གྱུར་ཏེ།
en: He lost his arrogance about his own appearance,

source: དྲང་སྲོང་དེ་ལ་ཡང་དགའ་བར་གྱུར་ཏོ། །
en: and felt joy toward the sage.

source: དགའ་བར་གྱུར་ནས། དྲང་སྲོང་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: In his joy he approached the sage,

source: དེའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: and upon his arrival he touched his head to his feet

source: དེ་ནས་དེས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ། དེ་ནས་ཁྱེའུ་དེ་དྲང་སྲོང་དེ་ཉིད་ལས་རབ་ཏུ་བྱུང་ངོ་། །
en: Then the sage taught the young man the Dharma particularly suited to him, and the young man went forth in that very sage’s presence.

source: དེ་རབ་ཏུ་བྱུང་ནས་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: As a renunciant he generated the four meditative states and the five superknowledges.

source: དེའི་ཚེ་ཁྱེའུ་དེ་ཉིད་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཁྱེའུ་མི་འམ་ཅི་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that young man then is none other than this young man.

source: དེའི་ཚེ་ཡང་ངས་འདིའི་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པ་བསལ་ནས།
en: At that time I dispelled his arrogance about his appearance

source: བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་གནས་པར་བྱས་སོ། །
en: and placed him in the four meditative states and the five superknowledges.

source: ད་ལྟར་ཡང་ངས་འདིའི་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པ་བསལ་ནས།
en: Now as well I have dispelled his arrogance about his appearance

source: གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཞག་གོ། །
en: and established him in the unsurpassed, supreme welfare of nirvāṇa.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་འདི་རབ་ཏུ་བྱུང་སྟེ།
en: “He also went forth in the teaching of the totally and completely awakened Buddha Kāśyapa.

source: དེར་འདིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས། དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པས་ན། དེའི་ཕྱིར་ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: After practicing pure conduct all his life then, his faculties ripened, and now he has been liberated.”

source: མི་འམ་ཅི་གཉིས་པ་ནི།
en: The Second “Kinnara” Story

source: གླེང་གཞི་ཡུལ་སེར་སྐྱའི་གནས་ན་བཞུགས་ཏེ། དེར་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཡབ་དང་། སྲས་མཇལ་བར་མཛད་པ་དེའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱིས། ཉི་མ་གཅིག་ནི་རྒྱལ་པོ་ཟས་གཙང་གི་དེར་བཤོས་གསོལ་ཏོ། །
en: When the Blessed One was in Kapilavastu visiting his father and his son, one day King Śuddhodana invited the Blessed One for a meal,

source: ཕྱི་ཉིན་ནི་བཙུན་མོའི་འཁོར་དུ་བཤོས་གསོལ་ཏོ། །
en: so the next day the Blessed One took his meal with the king’s retinue of queens.

source: དེར་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་བཙུན་མོའི་འཁོར་དུ་བཤོས་གསོལ་ནས། སླར་གཤེགས་པ་དེའི་ཚེ། གྲགས་འཛིན་མ་ཁང་ཐོག་ཏུ་སོང་ནས། བཅོམ་ལྡན་འདས་ལ་བལྟ་ཞིང་འདུག་གོ། །
en: After the Blessed One had taken his meal with the retinue of queens and was on his way back, Yaśodharā climbed to the roof of the house and stood there gazing after the Blessed One.

source: དེ་ནས་གང་གིས་སྐབས་སུ་མི་མཐོང་བར་གྱུར་པ་དེའི་སྐབས་སུ། ཁང་ཐོག་ནས་མཆོངས་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ས་གཞི་སྟན་ཤིང་བལ་གྱི་ནང་ཚང་ཅན་འདྲ་བར་བསྒྱུར་ཏེ
en: When she could not see him anymore, she leapt from the roof, and as she did so, by the power of the Buddha the ground became like a cotton cushion stuffed with wool,

source: ཅི་ནས་དེ་ལ་ཅུང་ཟད་ཀྱང་མི་གནོད་པར་མཛད་དོ། །
en: such that she was not harmed in the least.

source: དེ་ནས་སྐབས་དེ་རྣམས་དགེ་སློང་རྣམས་ཀྱིས་ཐོས་ནས། དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: When the monks heard about these events, they requested the Blessed Buddha,

source: བཙུན་པ་གྲགས་འཛིན་མས་བཅོམ་ལྡན་འདས་ཀྱི་སླད་དུ། རང་གི་སྲོག་བཏང་བ་ལ་གཟིགས།
en: “Lord, tell us why on the Blessed One’s account Yaśodharā sought to give up her life.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་ངའི་ཕྱིར་འདིས་ཅི་ལྟར་རང་གི་སྲོག་བཏང་བ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, on my account she gave up her life. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན། རྒྱལ་པོ་ཚངས་པས་བྱིན་རྒྱལ་པོ་བྱེད་དོ། །
en: “Monks, in times gone by, King Brahmadatta reigned in the city of Vārāṇasī.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས། རི་དགས་བཤོར་དུ་སོང་བ་ལས།
en: One day King Brahmadatta arrayed the four divisions of his army and set out to hunt deer,

source: དེ་རྟ་ཁ་མ་ཐུབ་ནས། དཔུང་གི་ཚོགས་ཀྱང་ལོགས་ཤིག་ཏུ་ལུས། རྒྱལ་པོ་ཡང་ལོགས་ཤིག་ཏུ་སོང་སྟེ།
en: but he could not rein in his horse, so the king lost the divisions of his army and ended up somewhere else.

source: དེ་དཔུང་དང་བྲལ་ནས་ལུས་ངལ་བ་དང་། ལུས་སྡུག་བསྔལ་བ་དང་། ལུས་ཞིག་པར་གྱུར་ཏེ་ནགས་ཁྲོད་ཅིག་ཏུ་ཞུགས་ཏེ་འདུག་གོ། །
en: Separated from his army, his body tired and aching, he entered the forest and sat down.

source: ནགས་ཁྲོད་དེ་ན་མིའམ་ཅི་ཞིག་མི་འམ་ཅི་མོ་དང་ལྷན་ཅིག་ཏུ་པི་ཝང་ཐོགས་ཏེ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: “In that forest a certain kinnara and kinnarī were playing the lute, enjoying themselves, and coupling.

source: དེ་ནས་རྒྱལ་པོ་དེས་དེ་མཐོང་ནས། མཐོང་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་མི་འམ་ཅི་མོ་དེ་ལ་ཤིན་ཏུ་ཆགས་པར་གྱུར་ཏོ། །
en: When he saw them the king immediately fixated on the kinnarī.

source: དེ་འདོད་ཆགས་ཀྱི་དབང་དུ་གྱུར་ནས། མི་འམ་ཅི་དེ་དུག་མདས་གནད་དུ་བསྣུན་ཏེ། དེ་ས་ཕྱོགས་དེ་ཉིད་དུ་ཤིའོ། །
en: Under the sway of lust he impaled the kinnara with a poisonous arrow, and the kinnara died on the spot.

source: དེ་ནས་རྒྱལ་པོ་དེས་མི་འམ་ཅི་དེ་བསད་པའི་འོག་ཏུ་མིའམ་ཅི་མོའི་ཐད་དུ་སོང་སྟེ། སྨྲས་པ།
en: Having slain the kinnara, the king approached the kinnarī and said,

source: བཟང་མོ་ཚུར་ཤོག་བདག་ཅག་གཉིས་དགའ་མགུར་སྤྱད་པར་བྱའོ། །
en: ‘Come with me, my dear. Let the two of us enjoy ourselves.’

source: མིའམ་ཅི་མོས་སྨྲས་པ།
en: “The kinnarī said,

source: ཁྱིམ་ཐབ་ཤི་བའི་རོ་མདུན་ན་འདུག་བཞིན་དུ་བདག་ཅི་ལྟར་ཁྱོད་དང་དགའ་མགུར་སྤྱོད་པར་བྱ།
en: ‘How can I enjoy myself with you when the dead body of my husband lies impaled before me?

source: རེ་ཞིག་འདིའི་རུས་བུ་ལ་མཆོད་པ་བྱས་ནས།
en: Let me venerate his relics for some time first.

source: དེའི་འོག་ཏུ་ཁྱོད་ཅི་ལྟར་འདོད་པ་བཞིན་དུ་བྱའོ་ཞེས་སྨྲས་ནས།
en: After that I’ll do as you wish.’

source: དེས་ཤིང་རྣམས་བསྡུས་ཏེ། སྤུངས་པའི་སྟེང་དུ་མི་འམ་ཅིའི་རུས་བུ་དེ་བཞག་ནས་མེ་བཏང་སྟེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: She gathered wood, placed the relics of the kinnara on the pile, lit the fire, and took a seat at one side.

source: དེ་ནས་གང་གི་ཚེ་རུས་བུ་དེ་བསྲེགས་པའི་ཤིང་དེ་དག་ལ་མེ་འབར་བར་གྱུར་པ་དེའི་ཚེ། མི་འམ་ཅི་མོ་དེ་ཉིད་མེའི་ནང་དུ་མཆོངས་ནས། དེ་དེར་ཤིའོ། །
en: As the wood for the funeral pyre began to blaze, the kinnarī leapt into the fire and died.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་དེ་རེ་ཐག་ཆད་ནས། དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Thereupon the king recited the following verse out of despair:

source: བདག་གིས་དོན་གཞན་བསམ་བསམ་ནས། །ལོག་པར་གཞན་དུ་གྱུར་གྱིས་མེད། །
en: “ ‘While I focused on another task Things went wrong, so now she’s gone.

source: མི་འམ་ཅི་མོ་སྤྱད་སྙམ་ནས། །བདག་གིས་སྲོག་ཆགས་གཉིས་བསད་དོ། །
en: I fantasized about the kinnarī, And now I’ve killed two beings.’

source: དེའི་ཚེ་མིའམ་ཅིར་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: I was that kinnara then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་མི་འམ་ཅི་མོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་གྲགས་འཛིན་མ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was the kinnarī then is none other than Yaśodharā.

source: དེའི་ཚེ་ཡང་འདིས་ངའི་ཕྱིར་བདག་ཉིད་ཡོངས་སུ་བཏང་ལ། ད་ལྟར་ཡང་འདིས་ངའི་ཕྱིར་བདག་ཉིད་ཡོངས་སུ་བཏང་ངོ་། །
en: At that time she sacrificed her life for me, and now she has tried to cast away her life for me as well.”

source: ལས་བརྒྱ་ཐམ་པ་ལས་སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་བདུན་པ་རྫོགས་སོ།། །།
en: This concludes Part Seven of The Hundred Deeds.

source: སྡོམ་ནི། གང་པོ་མཆོད་སྦྱིན་ལེ་ལོ་ཅན། །མགོན་མེད་དང་ནི་ཉམ་ཆུང་བ། །པད་མ་གཉིས་དང་ལྟ་བ་དང་། །རིན་ཆེན་ནོར་དང་སྟོབས་ཕྲོག་པ། །གང་པོ་དང་ནི་དོན་གཟིགས་དང་། །སྟོབས་བརྩོན་རྩལ་དང་མྱ་ངན་མེད། །འཐུན་མཛད་དང་ནི་པད་མ་ཡི། །བླ་མ་གཉིས་དང་ལེགས་མཐོང་དང་། །རིན་ཆེན་གཙུག་ཏོར་ཆུ་རླབས་དང་། །རྣམ་པར་རྒྱལ་བ་ཐ་མའོ། །ཞེས་བྱ་བ་ནི་སྡོམ་གྱི་ཚིགས་སུ་བཅད་པའོ། །
en: 1. The Story of Pūrṇa 2. The Sacrifice 3. The Lazy Man 4. A Story about Anāthapiṇḍada 5. The Humble One 6. Padmottama: Two Stories 7. The Story of Sudarśana 8. The Story of Ratnaśikhin 9. Wealth 10. The Story of Vijaya

source: གང་པོ་ཞེས་བྱ་བ་ནི།
en: The Story of Pūrṇa

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ། དེའི་ཚེ་ལྷོ་ཕྱོགས་ཀྱི་རི་བོའི་ལྗོངས་ན། རི་བྲགས་ཀྱི་གྲོང་ཞིག་ན་བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བ་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ།
en: When the Blessed One was in in Rājagṛha, in a remote mountain village in a valley to the south there lived a certain great, high brahmin. He was prosperous and wealthy,

source: ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་མཉམ་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ།
en: a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: བྱམས་པའི་རང་བཞིན་ཅན། སྙིང་རྗེ་དང་ལྡན་པ། སེམས་ཅན་ལ་མཉེས་གཤིན་པ་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བ།
en: He had a loving nature, was compassionate, loved beings like a parent loves their child, and cared deeply for all beings.

source: གང་པོ་ཞེས་བྱ་བ་ཞིག་གནས་ཏེ
en: His name was Pūrṇa.

source: དེ་ནི་ཁྱིམ་ན་གནས་པ་དང་། རབ་ཏུ་བྱུང་བ་རྣམས་དང་། སློང་བ་ཐམས་ཅད་ལ་གཏོང་ཞིང་སྡུད་པར་བྱེད་དོ། །
en: He would assemble all the householders, renunciants, and beggars, and give gifts to them.

source: དུས་དུས་སུ་མཆོད་སྦྱིན་གྱི་གནས་བཅས་ནས་མཆོད་སྦྱིན་ཡང་བྱེད་དོ། །
en: From time to time he would set up a site for a sacrifice and perform a sacrifice.

source: དེ་ནས་མཆོད་སྦྱིན་གྱི་དུས་ཞིག་ལ་བབ་པའི་ཚེ། བསྟན་བཅོས་ཐམས་ཅད་ཀྱི་གཞུང་རྣམས་ལ་རྟོག་ཅིང་། གང་དང་གང་གི་ལྟ་བ་ཅི་འདྲ་བ་ཞིག་སྙམ་སྟེ།
en: When the time came to perform the sacrifice, he would examine the doctrines of all the treatises and ponder what kind of view this and that one contained.

source: དེས་གཞུང་དེ་དག་ཡིད་ལ་བཞག་ནས། སེམས་པ་དང་འཇལ་བ་དང་ཡོངས་སུ་རྟོག་པར་བྱེད་དོ། །
en: Once he had them all in his mind, he would reflect on them and consider them deeply until he understood them perfectly.

source: དེ་ནས་ཕྱི་ཞིག་ན་བྲམ་ཟེ་དེས་མཆོད་སྦྱིན་བྱ་བར་བརྩམས་ནས། མཆོད་སྦྱིན་བྱེད་པ་དེར་སྟོན་པ་ཐམས་ཅད་འདུས་པར་གྱུར་ཏོ། །
en: One day, as the brahmin began to perform his sacrifice, all the teachers gathered at the site of the sacrifice.

source: བྲམ་ཟེ་དེས་ཀྱང་སྟོན་པ་ཐམས་ཅད་ཀྱི་གཞུང་ཡིད་ལ་བཞག་ནས་
en: The brahmin had memorized all these teachers’ scriptures,

source: སེམས་པ་ལ་ཞུགས་པ་ལས། ལྟ་བའི་རྣམ་པ་དེ་དག་ལ་དེའི་སེམས་མགུ་བར་མ་གྱུར་ཏོ། །
en: and as he began to reflect on them, he found his mind was ill at ease with different aspects of their views.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོའི་ཁབ་ན་གནས་པའི་དགེ་བསྙེན་རྣམས་ཀྱིས་བྲམ་ཟེ་དེའི་མདུན་དུ་སངས་རྒྱས་ཀྱི་བསྔགས་པ་བརྗོད་དོ། །
en: One day the lay vow holders of Rājagṛha extolled the virtues of the Buddha in the brahmin’s presence.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་བྲམ་ཟེ་དེས་བཅོམ་ལྡན་འདས་ལ་བལྟ་འདོད་པར་གྱུར་ཏོ། །
en: Now as soon as the brahmin heard them, he wished to see the Blessed One.

source: དགེ་སྦྱོང་དང་བྲམ་ཟེ་སྟོང་ཕྲག་དུ་མ་དག་གིས་མཆོད་སྦྱིན་ལ་འོངས་ནས་ལོངས་སྤྱོད་པར་བྱེད་ལ། བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དེ་ནི་མི་འོང་བ་ན།
en: “Though thousands upon thousands of ascetics and brahmins come and partake of the sacrifice, the Blessed Gautama still has not come.

source: ཀྱེ་མ་དེ་ཡང་བདག་གི་མཆོད་སྦྱིན་ལ་འོང་སྟེ། ལོངས་སྤྱོད་པར་བྱེད་ཀྱང་ཅི་མ་རུང་སྙམ་མོ། །
en: Wouldn’t it be nice if he came and partook of my sacrifice!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་དེའི་སེམས་ཐུགས་ཀྱིས་མཁྱེན་ནས་དགོངས་པ།
en: The Blessed One directly apprehended what was in his mind and thought,

source: བྲམ་ཟེ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་སེམས་བསྐྱེད་པར་འགྱུར་ལ་དེ་ཁོ་ན་ལ་བརྟེན་ཏེ
en: “This brahmin will pursue unexcelled, total, and complete enlightenment with single-minded resolve.

source: བདག་གིས་སྐྱེ་བོ་མང་པོ་ལ་ཕན་གདགས་སོ་སྙམ་དུ་དགོངས་ནས།
en: He will be instrumental in my acting for the benefit of many.”

source: དགེ་སློང་མང་པོས་ཞབས་འབྲིང་བྱས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས། བྲམ་ཟེ་དེ་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར། རི་བྲགས་ཀྱི་གྲོང་ཁྱེར་དེར་གཤེགས་སོ། །
en: So out of compassion for that brahmin, he set out for the remote mountain village, surrounded and attended by an assembly of monks.

source: བཅོམ་ལྡན་འདས་དེར་གཤེགས་ནས་འདི་སྙམ་དུ་དགོངས་ཏེ།
en: As the Blessed One was traveling, he thought,

source: མ་ལ་བདག་གིས་ཅི་ནས་མཆོད་སྦྱིན་གྱི་གནས་དེར་མཆོད་སྦྱིན་གྱི་བདག་པོ་དང་། སྐྱེ་བོ་མང་པོ་གཞན་རྣམས་ཀྱིས་བདག་གཅིག་པུ་མཐོང་ལ།
en: “It should appear to the sacrifice master and the others at the sacrifice site as if I am alone,”

source: དགེ་སློང་གི་དགེ་འདུན་རྣམས་སུས་ཀྱང་མི་མཐོང་བ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབ་བོ་སྙམ་དུ་དགོངས་ཏེ
en: and he performed a miracle that caused them not to see the rest of the saṅgha of monks.

source: དེ་ལྟར་བྱིན་གྱིས་བརླབས་ནས། མཆོད་སྦྱིན་གྱི་གནས་སུ་གཤེགས་སོ། །
en: Having performed this miracle, he proceded to the site of the sacrifice.

source: དེ་ནས་བྲམ་ཟེ་དེས་ཐག་རིང་པོ་ཞིག་ནས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: The brahmin saw the Blessed One from a distance,

source: མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: and when he saw the Blessed One, he called to him,

source: བཅོམ་ལྡན་འདས་ཚུར་གཤེགས།
en: This way, Blessed One—if you please.
